_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ЗакрытиеОбъектаСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ЗакрытиеОбъектаСтроительства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.СебестоимостьТоваров</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВРеглУчете</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВМеждународномУчете</xr:Item>
				<xr:Item>AccumulationRegister.СвободныеОстатки</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_НДСИнвестиционный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВосстанавливатьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьПроектная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратПР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратВР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ВидыОперацийСОбъектамиСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьПроектная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратПР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратВР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СдачаИнвестору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьПроектная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратПР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатратВР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВосстановлениеНДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ЗакрытиеОбъектаСтроительства/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы документа.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ПолучитьФункциональнуюОпцию("УСОERP_НоваяУчетнаяПолитикаПоДолевомуСтроительству") Тогда
			Отказ = Истина;
		КонецЕсли;		
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   	
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
// Процедура - обработчик события "ПриЧтенииНаСервере" формы документа.
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УСОERP_МодификацияКонфигурацииКлиент.ПоказатьПредупреждениеДолевогоСтроительства();
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события "ОбработкаПроверкиЗаполненияНаСервере" формы документа.
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

&НаСервере
// Процедура - обработчик события "ПередЗаписьюНаСервере" формы документа.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры // ПередЗаписьюНаСервере()

&НаСервере
// Процедура - обработчик события "ПослеЗаписиНаСервере" формы документа.
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры // ПослеЗаписиНаСервере()

&НаКлиенте
// Процедура - обработчик события "ОбработкаОповещения" формы документа.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;

КонецПроцедуры // ОбработкаОповещения()

&НаКлиенте
// Процедура - обработчик события "ПослеЗаписи" формы документа.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры // ПослеЗаписи()

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" флажка восстановления НДС.
//
Процедура ВосстанавливатьНДСПриИзменении(Элемент)
	
	ВосстанавливатьНДСПриИзмененииНаСервере();
	
КонецПроцедуры // ВосстанавливатьНДСПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода суммы затрат (БУ).
//
Процедура СуммаЗатратПриИзменении(Элемент)
	
	Объект.СуммаЗатрат = СуммаЗатрат + СуммаНДСВключенногоВСтоимость;
	
КонецПроцедуры // СуммаЗатратПриИзменении()

&НаСервере
// Серверная процедура - обработчик события "ПриИзменении" флажка восстановления НДС.
//
Процедура ВосстанавливатьНДСПриИзмененииНаСервере()
	
	УправлениеЭлементамиФормы();
	РассчитатьСуммуНДСВключенногоВСтоимость();
	
КонецПроцедуры // ВосстанавливатьНДСПриИзмененииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
// Процедура - обработчик события "Нажатие" команды расчета актуальных сумм документа.
//
Процедура РассчитатьСуммыДокумента(Команда)
	
	Если Не Объект.ВосстановлениеНДС.Количество() = 0
	 Или Не Объект.СуммаЗатрат = 0
	 Или Не Объект.СуммаЗатратНУ = 0
	 Или Не Объект.СуммаЗатратПР = 0 
	 Или Не Объект.СуммаЗатратВР = 0 Тогда

		ТекстВопроса = НСтр("ru='Перед расчетом сумм документа некоторые данные будут перезаполнены. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("РассчитатьСуммыДокументаЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;

	КонецЕсли;
	
	РассчитатьСуммыДокументаНаСервере();
	
КонецПроцедуры // РассчитатьСуммыДокумента()

&НаКлиенте
// Завершение процедуры - обработчика события "Нажатие" команды расчета актуальных сумм документа.
//
Процедура РассчитатьСуммыДокументаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	РассчитатьСуммыДокументаНаСервере();

КонецПроцедуры // РассчитатьСуммыДокументаЗавершение()

&НаКлиенте
// Процедура - обработчик события "Нажатие" команды заполнения данными по объекту.
//
Процедура ЗаполнитьДаннымиПоОбъекту(Команда)
	
	Если Не Объект.ОбъектыНедвижимости.Количество() = 0 Тогда

		ТекстВопроса = НСтр("ru='Перед заполнением табл. часть ""Объекты недвижимости"" будет очищена. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДаннымиПоОбъектуЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;

	КонецЕсли;

	ЗаполнитьДаннымиПоОбъектуНаСервере();
	
КонецПроцедуры // ЗаполнитьДаннымиПоОбъекту()

&НаКлиенте
// Завершение процедуры - обработчика события "Нажатие" команды заполнения данными по объекту.
//
Процедура ЗаполнитьДаннымиПоОбъектуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	ЗаполнитьДаннымиПоОбъектуНаСервере();

КонецПроцедуры // ЗаполнитьДаннымиПоОбъектуЗавершение()

&НаКлиенте
// Процедура - обработчик события "Нажатие" команды распределения данных по объекту.
//
Процедура РаспределитьДанныеПоОбъекту(Команда)
	
	Если Объект.ОбъектыНедвижимости.Количество() = 0 
	 Или ПроверитьЗаполнениеРеквизитовДляРаспределенияДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.ПринятиеКУчету.Количество() = 0 
	 Или Не Объект.СдачаИнвестору.Количество() = 0 Тогда

		ТекстВопроса = НСтр("ru='Перед заполнением табл. части ""Принятие к учету"" и ""Сдача инвестору"" будут очищены. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("РаспределитьДанныеПоОбъектуЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;

	КонецЕсли;

	РаспределитьДанныеПоОбъектуНаСервере();
	
КонецПроцедуры // РаспределитьДанныеПоОбъекту()

&НаКлиенте
// Завершение процедуры - обработчика события "Нажатие" команды распределения данных по объекту.
//
Процедура РаспределитьДанныеПоОбъектуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	РаспределитьДанныеПоОбъектуНаСервере();

КонецПроцедуры // РаспределитьДанныеПоОбъектуЗавершение()

&НаСервере
// Процедура формирует структуру параметров и вызывает функции/процедуры расчета актуальных сумм документа. 
//
Процедура РассчитатьСуммыДокументаНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаДокумента"	   , Объект.Дата);
	СтруктураПараметров.Вставить("Организация"		   , Объект.Организация);
	СтруктураПараметров.Вставить("ОбъектСтроительства" , Объект.ОбъектСтроительства);
	СтруктураПараметров.Вставить("Счет"				   , Объект.Счет);
	
	Объект.ВосстановлениеНДС.Загрузить(Документы.УСОERP_ЗакрытиеОбъектаСтроительства.ПолучитьДанныеЗаполненияВосстановленияНДС(СтруктураПараметров));
	ЗаполнитьЗначенияСвойств(Объект, Документы.УСОERP_ЗакрытиеОбъектаСтроительства.ПолучитьДанныеПоОстаткамХозрасчетного(СтруктураПараметров));
	
	РассчитатьСвязанныеРеквизитыДокументаПоОбъектуСтроительства();
	
КонецПроцедуры // РассчитатьСуммыДокументаНаСервере()

&НаСервере
// Процедура формирует структуру параметров и вызывает функции/процедуры заполнения данными по объекту.
//
Процедура ЗаполнитьДаннымиПоОбъектуНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаДокумента"	   , Объект.Дата);
	СтруктураПараметров.Вставить("ОбъектСтроительства" , Объект.ОбъектСтроительства);
	СтруктураПараметров.Вставить("ПлощадьФактическая"  , ПлощадьФактическая);
	СтруктураПараметров.Вставить("СуммаЗатрат"		   , СуммаЗатрат);
	СтруктураПараметров.Вставить("СуммаЗатратНУ"	   , Объект.СуммаЗатратНУ);
	СтруктураПараметров.Вставить("СуммаЗатратПР"	   , Объект.СуммаЗатратПР);
	СтруктураПараметров.Вставить("СуммаЗатратВР"	   , Объект.СуммаЗатратВР);
	
	Объект.ОбъектыНедвижимости.Загрузить(Документы.УСОERP_ЗакрытиеОбъектаСтроительства.ПолучитьДанныеЗаполненияОбъектовНедвижимости(СтруктураПараметров));
	ИсправитьОшибкиОкругленияПослеЗаполненияОбъектовНедвижимости(СтруктураПараметров);
	
КонецПроцедуры // ЗаполнитьДаннымиПоОбъектуНаСервере()

&НаСервере
// Процедура формирует структуру параметров и вызывает функции/процедуры распределения данных по объекту.
//
Процедура РаспределитьДанныеПоОбъектуНаСервере()

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаДокумента"	   , Объект.Дата);
	СтруктураПараметров.Вставить("Организация"		   , Объект.Организация);
	СтруктураПараметров.Вставить("ГруппаНоменклатуры"  , Объект.ГруппаНоменклатуры);
	СтруктураПараметров.Вставить("ОбъектыНедвижимости" , Объект.ОбъектыНедвижимости.Выгрузить());
	
	Документы.УСОERP_ЗакрытиеОбъектаСтроительства.СоздатьНоменклатуруДляОбъектовНедвижимости(СтруктураПараметров);
	Объект.ПринятиеКУчету.Загрузить(Документы.УСОERP_ЗакрытиеОбъектаСтроительства.ПолучитьДанныеЗаполненияПринятияКУчету(СтруктураПараметров));
	Объект.СдачаИнвестору.Загрузить(Документы.УСОERP_ЗакрытиеОбъектаСтроительства.ПолучитьДанныеЗаполненияСдачиИнвестору(СтруктураПараметров));

КонецПроцедуры // РаспределитьДанныеПоОбъектуНаСервере()

#КонецОбласти

#Область Прочее

&НаСервере
// Процедура вызывается при чтении и создании формы документа на сервере.
//
Процедура ПриЧтенииСозданииНаСервере()

	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);

	УправлениеЭлементамиФормы();
	РассчитатьСвязанныеРеквизитыДокументаПоОбъектуСтроительства();
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере()

&НаСервере
// Процедура управляет видимостью/доступностью/просмотром элементов формы по установленным условиям.
//
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ГруппаВосстановлениеНДС.Видимость = Объект.ВосстанавливатьНДС;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

&НаСервере
// Процедура рассчитывает связанные реквизиты документа по указанному объекту строительства.
//
Процедура РассчитатьСвязанныеРеквизитыДокументаПоОбъектуСтроительства()
	
	РассчитатьПроектнуюПлощадьОбъектаСтроительства();
	РассчитатьФактическуюПлощадьОбъектаСтроительства();
	РассчитатьСуммуНДСВключенногоВСтоимость();

КонецПроцедуры // РассчитатьСвязанныеРеквизитыДокументаПоОбъектуСтроительства()

&НаСервере
// Процедура рассчитывает значение реквизита "Общая проектная площадь" по данным регистра сведений.
//
Процедура РассчитатьПроектнуюПлощадьОбъектаСтроительства()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента"		, Объект.Дата);
	Запрос.УстановитьПараметр("ОбъектСтроительства"	, Объект.ОбъектСтроительства);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(СУММА(ПлощадиОбъектовНедвижимости.ОбщаяПлощадь), 0) КАК ПлощадьПроектная
	               |ИЗ
	               |	РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(&ДатаДокумента, ОбъектНедвижимости.ОбъектЭксплуатации = &ОбъектСтроительства) КАК ПлощадиОбъектовНедвижимости";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
КонецПроцедуры // РассчитатьПроектнуюПлощадьОбъектаСтроительства()

&НаСервере
// Процедура рассчитывает значение реквизита "Общая фактическая площадь" по данным регистра сведений.
//
Процедура РассчитатьФактическуюПлощадьОбъектаСтроительства()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента"		, Объект.Дата);
	Запрос.УстановитьПараметр("ОбъектСтроительства"	, Объект.ОбъектСтроительства);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(СУММА(ПараметрыОбъектовНедвижимостиПоБТИ.ОбщаяПлощадь), 0) КАК ПлощадьФактическая
	               |ИЗ
	               |	РегистрСведений.УПН_ПараметрыОбъектовНедвижимостиПоБТИ.СрезПоследних(&ДатаДокумента, ОбъектНедвижимости.ОбъектЭксплуатации = &ОбъектСтроительства) КАК ПараметрыОбъектовНедвижимостиПоБТИ";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
КонецПроцедуры // РассчитатьФактическуюПлощадьОбъектаСтроительства()

&НаСервере
// Процедура рассчитывает значение реквизита "Сумма НДС включенного в стоимость" по данным табл. части документа.
//
Процедура РассчитатьСуммуНДСВключенногоВСтоимость()
	
	СуммаНДСВключенногоВСтоимость = ?(Объект.ВосстанавливатьНДС, Объект.ВосстановлениеНДС.Итог("СуммаНДС"), 0);
	СуммаЗатрат					  = Объект.СуммаЗатрат - СуммаНДСВключенногоВСтоимость;
	
КонецПроцедуры // РассчитатьСуммуНДСВключенногоВСтоимость()

&НаСервере
// Процедура исправляет ошибки округления сумм после заполнения табл. части "Объекты недвижимости".
//
Процедура ИсправитьОшибкиОкругленияПослеЗаполненияОбъектовНедвижимости(СтруктураПараметров)
	
	ИтогСуммыЗатрат = Объект.ОбъектыНедвижимости.Итог("СуммаЗатрат");
	Если Не ИтогСуммыЗатрат = СтруктураПараметров.СуммаЗатрат Тогда
		ОбработатьОшибкуОкругленияПоследнейСтроки(ИтогСуммыЗатрат, СтруктураПараметров.СуммаЗатрат, "СуммаЗатрат");	
	КонецЕсли;
	
	ИтогСуммыЗатратНУ = Объект.ОбъектыНедвижимости.Итог("СуммаЗатратНУ");
	Если Не ИтогСуммыЗатратНУ = СтруктураПараметров.СуммаЗатратНУ Тогда
		ОбработатьОшибкуОкругленияПоследнейСтроки(ИтогСуммыЗатратНУ, СтруктураПараметров.СуммаЗатратНУ, "СуммаЗатратНУ");	
	КонецЕсли;
	
	ИтогСуммыЗатратПР = Объект.ОбъектыНедвижимости.Итог("СуммаЗатратПР");
	Если Не ИтогСуммыЗатратПР = СтруктураПараметров.СуммаЗатратПР Тогда
		ОбработатьОшибкуОкругленияПоследнейСтроки(ИтогСуммыЗатратПР, СтруктураПараметров.СуммаЗатратПР, "СуммаЗатратПР");	
	КонецЕсли;
	
	ИтогСуммыЗатратВР = Объект.ОбъектыНедвижимости.Итог("СуммаЗатратВР");
	Если Не ИтогСуммыЗатратВР = СтруктураПараметров.СуммаЗатратВР Тогда
		ОбработатьОшибкуОкругленияПоследнейСтроки(ИтогСуммыЗатратВР, СтруктураПараметров.СуммаЗатратВР, "СуммаЗатратВР");	
	КонецЕсли;
	
КонецПроцедуры // ИсправитьОшибкиОкругленияПослеЗаполненияОбъектовНедвижимости()

&НаСервере
// Процедура обрабатывает ошибку округления в последней строке табл. части "Объекты недвижимости". 
//
Процедура ОбработатьОшибкуОкругленияПоследнейСтроки(ИтогСуммы, КорректнаяСумма, ИмяКолонки)
	
	РазницаРассчитаныхСумм = ИтогСуммы - КорректнаяСумма;
	КоличествоСтрок		   = Объект.ОбъектыНедвижимости.Количество();
	ИндексПоследнейСтроки  = КоличествоСтрок - 1;
	
	Если Не ИндексПоследнейСтроки < 0 Тогда
		Объект.ОбъектыНедвижимости[ИндексПоследнейСтроки][ИмяКолонки] = Объект.ОбъектыНедвижимости[ИндексПоследнейСтроки][ИмяКолонки] - РазницаРассчитаныхСумм;	
	КонецЕсли;
	
КонецПроцедуры // ОбработатьОшибкуОкругленияПоследнейСтроки()

&НаСервере
// Процедура обновляет элементы дополнительных реквизитов при оповещении с других форм.
//
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

&НаКлиенте
// Функция проверяет заполнение необходимых реквизитов и возвращает результат данной проверки.
//
Функция ПроверитьЗаполнениеРеквизитовДляРаспределенияДанных()
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ГруппаНоменклатуры) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поле ""Группа"" не заполнено'"), Объект.Ссылка, "ГруппаНоменклатуры", "Объект", Отказ);  	
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции // ПроверитьЗаполнениеРеквизитовДляРаспределенияДанных()


#КонецОбласти
